In [1]:
import pandas as pd

In [2]:
df= pd.read_csv("raw_data.csv")

In [3]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [4]:
df.isnull()

       id   name    age  country  gender  income
0   False  False  False    False   False   False
1   False  False  False    False   False   False
2   False  False   True    False   False   False
3   False  False   True    False   False   False
4   False  False  False    False   False    True
5   False  False  False    False   False   False
6   False   True  False    False   False   False
7   False  False  False     True   False   False
8   False  False  False    False   False   False
9   False  False   True    False   False   False
10  False  False  False    False    True   False

In [5]:
df.isnull().sum()
df.dropna()
age=df["age"].mean()

df["age"].fillna(age)

0     29.00
1     29.00
2     32.75
3     32.75
4     34.00
5     27.00
6     45.00
7     38.00
8     29.00
9     32.75
10    31.00
Name: age, dtype: float64

In [6]:
df.duplicated()

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [7]:
df["gender"].str.capitalize()

0        Male
1        Male
2      Female
3     Unknown
4      Female
5        Male
6      Female
7        Male
8      Female
9        Male
10        NaN
Name: gender, dtype: object

In [8]:
df["name"].str.split(",")

0         [John Doe]
1         [John Doe]
2       [Jane Smith]
3             [Alex]
4     [Maria Garcia]
5           [Li Wei]
6                NaN
7       [Ahmed Khan]
8       [Rachel Lee]
9      [Carlos Ruiz]
10     [Emily Davis]
Name: name, dtype: object

In [9]:
df["country"].str.contains("india",case=False)

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7       NaN
8     False
9     False
10    False
Name: country, dtype: object

In [27]:
df2=df.copy()
df2["tax"]=df2["income"].apply(lambda x:"12%" if x>= 60000 else "10%")
gender_map={
    "Male":"M",
    "Female":"f",
    "Unknown":"U"
}
df2["gender"] =df2["gender"].map(gender_map)
df2=df2.assign(new_income=df2["income"]*1.1)
df2["sat"]=df2["income"].apply(lambda x : x-x*0.12 if x>=60000 else x-x*0.10)
df2

    id          name   age country gender   income  tax  new_income      sat
0    1      John Doe  29.0     USA      M  55000.0  10%     60500.0  49500.0
1    1      John Doe  29.0     USA      M  55000.0  10%     60500.0  49500.0
2    2    Jane Smith   NaN  Canada      f  62000.0  12%     68200.0  54560.0
3    3          Alex   NaN     USA      U  47000.0  10%     51700.0  42300.0
4    4  Maria Garcia  34.0   Spain      f      NaN  10%         NaN      NaN
5    5        Li Wei  27.0   China      M  51000.0  10%     56100.0  45900.0
6    6           NaN  45.0   India      f  73000.0  12%     80300.0  64240.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  12%     74800.0  59840.0
8    8    Rachel Lee  29.0     USA      f  62000.0  12%     68200.0  54560.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0  40500.0
10  10   Emily Davis  31.0     USA    NaN  58000.0  10%     63800.0  52200.0

In [42]:
sorted_df=df2.sort_values("income",ascending=False)
sorted_df
sorted_df.reset_index()
sorted_df["rank"]=sorted_df["income"].rank(ascending=False,method="dense")
sorted_df

,id,name,age,country,gender,income,tax,new_income,sat,rank
6,6,NaN,45.0,India,f,73000.0,12%,80300.0,64240.0,1.0
7,7,Ahmed Khan,38.0,NaN,M,68000.0,12%,74800.0,59840.0,2.0
2,2,Jane Smith,NaN,Canada,f,62000.0,12%,68200.0,54560.0,3.0
8,8,Rachel Lee,29.0,USA,f,62000.0,12%,68200.0,54560.0,3.0
10,10,Emily Davis,31.0,USA,NaN,58000.0,10%,63800.0,52200.0,4.0
0,1,John Doe,29.0,USA,M,55000.0,10%,60500.0,49500.0,5.0
1,1,John Doe,29.0,USA,M,55000.0,10%,60500.0,49500.0,5.0
5,5,Li Wei,27.0,China,M,51000.0,10%,56100.0,45900.0,6.0
3,3,Alex,NaN,USA,U,47000.0,10%,51700.0,42300.0,7.0
9,9,Carlos Ruiz,NaN,Mexico,M,45000.0,10%,49500.0,40500.0,8.0
4,4,Maria Garcia,34.0,Spain,f,NaN,10%,NaN,NaN,NaN

In [43]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [45]:
df[["name","age","country","gender","income","id"]]

            name   age country   gender   income  id
0       John Doe  29.0     USA     Male  55000.0   1
1       John Doe  29.0     USA     Male  55000.0   1
2     Jane Smith   NaN  Canada   Female  62000.0   2
3           Alex   NaN     USA  Unknown  47000.0   3
4   Maria Garcia  34.0   Spain   Female      NaN   4
5         Li Wei  27.0   China     Male  51000.0   5
6            NaN  45.0   India   Female  73000.0   6
7     Ahmed Khan  38.0     NaN     Male  68000.0   7
8     Rachel Lee  29.0     USA   Female  62000.0   8
9    Carlos Ruiz   NaN  Mexico     Male  45000.0   9
10   Emily Davis  31.0     USA      NaN  58000.0  10

In [48]:
df2=df.copy()
df2.fillna(100)
df2=df2.sort_values("income")
df2=df2.reset_index(drop=True)
df2.to_csv("sorted_csv")

In [52]:
df2=df.copy()
df2.groupby("country")["income"].mean()
df2.groupby("country")[["income","age"]].max()

df2.groupby("country")["income"].agg(["mean","max","min"])

            mean      max      min
country
Canada   62000.0  62000.0  62000.0
China    51000.0  51000.0  51000.0
India    73000.0  73000.0  73000.0
Mexico   45000.0  45000.0  45000.0
Spain        NaN      NaN      NaN
USA      55400.0  62000.0  47000.0

In [58]:
melted_df=df2.melt(
    id_vars=["name","age"],
    value_vars=["country","gender","income"],
    var_name="metrics",
    value_name="value"

)
melted_df

            name   age  metrics    value
0       John Doe  29.0  country      USA
1       John Doe  29.0  country      USA
2     Jane Smith   NaN  country   Canada
3           Alex   NaN  country      USA
4   Maria Garcia  34.0  country    Spain
5         Li Wei  27.0  country    China
6            NaN  45.0  country    India
7     Ahmed Khan  38.0  country      NaN
8     Rachel Lee  29.0  country      USA
9    Carlos Ruiz   NaN  country   Mexico
10   Emily Davis  31.0  country      USA
11      John Doe  29.0   gender     Male
12      John Doe  29.0   gender     Male
13    Jane Smith   NaN   gender   Female
14          Alex   NaN   gender  Unknown
15  Maria Garcia  34.0   gender   Female
16        Li Wei  27.0   gender     Male
17           NaN  45.0   gender   Female
18    Ahmed Khan  38.0   gender     Male
19    Rachel Lee  29.0   gender   Female
20   Carlos Ruiz   NaN   gender     Male
21   Emily Davis  31.0   gender      NaN
22      John Doe  29.0   income  55000.0
23      John Doe  29.0   income  55000.0
24    Jane Smith   NaN   income  62000.0
25          Alex   NaN   income  47000.0
26  Maria Garcia  34.0   income      NaN
27        Li Wei  27.0   income  51000.0
28           NaN  45.0   income  73000.0
29    Ahmed Khan  38.0   income  68000.0
30    Rachel Lee  29.0   income  62000.0
31   Carlos Ruiz   NaN   income  45000.0
32   Emily Davis  31.0   income  58000.0

In [ ]:
melted_df=melted_df.pivot(
    index=["name","age"],
    columns="metrics",
    values="value"
)
melted_df

ValueError: Index contains duplicate entries, cannot reshape

In [62]:
df_customer

NameError: name 'df_customer' is not defined